---
type: WireType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 10
tags: [revit-api, class]
---

# WireType

`Autodesk.Revit.DB.Electrical.WireType` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Conduit | — | `public WireConduitType Conduit { get ; set ; }` |
| Property | Insulation | — | `public InsulationType Insulation { get ; set ; }` |
| Property | IsInUse | — | `public bool IsInUse { get ; }` |
| Property | MaxSize | — | `public WireSize MaxSize { get ; set ; }` |
| Property | NeutralMultiplier | — | `public double NeutralMultiplier { get ; set ; }` |
| Property | NeutralRequired | — | `public bool NeutralRequired { get ; set ; }` |
| Property | NeutralSize | — | `public NeutralMode NeutralSize { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | TemperatureRating | — | `public TemperatureRatingType TemperatureRating { get ; set ; }` |
| Property | WireMaterial | — | `public WireMaterialType WireMaterial { get ; set ; }` |